using SimpleProject.Interfaces;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SimpleProject.DataObjects
{
    public class PharmDataInitializer : IDataInitializer<Pharm>
    {
        public List<Pharm> GetInitialEntitiesList()
        {
            List<Pharm> entities = new List<Pharm>()
            {
                new Pharm("Цитрамон-Дарниця таблетки №6", "Цитрамон-Дарниця", "таблетки", "ацетилсаліцилова кислота, парацетамол, кофеїн", 6, "ацетилсаліцилова кислота: 240 мг, парацетамол: 180 мг, кофеїн: 30 мг", 22.6M, "ПрАТ «Фармацевтична фірма «Дарниця»", "Україна")
                ,new Pharm("Цитрамон-Дарниця таблетки №10", "Цитрамон-Дарниця", "таблетки", "ацетилсаліцилова кислота, парацетамол, кофеїн", 10, "ацетилсаліцилова кислота: 240 мг, парацетамол: 180 мг, кофеїн: 30 мг", 45.2M, "ПрАТ «Фармацевтична фірма «Дарниця»", "Україна")
                ,new Pharm("Аміксин IC таблетки, в/о по 0.125 г №3", "Аміксин IC", "таблетки, в/о", "аміксин (тилорон)", 3, "аміксин (тилорон): 125 мг", 247M, "ТДВ «ІНТЕРХІМ»", "Україна")
                ,new Pharm("Аміксин IC таблетки, в/о по 0.125 г №6", "Аміксин IC", "таблетки, в/о", "аміксин (тилорон)", 6, "аміксин (тилорон): 125 мг", 430M, "ТДВ «ІНТЕРХІМ»", "Україна")
                ,new Pharm("Аміксин IC таблетки, в/о по 0.125 г №10", "Аміксин IC", "таблетки, в/о", "аміксин (тилорон)", 10, "аміксин (тилорон): 125 мг", 588.8M, "ТДВ «ІНТЕРХІМ»", "Україна")
                ,new Pharm("Неуробекс-Тева таблетки, в/плів. обол. №90 у бан.", "Неуробекс-Тева", "таблетки", "ціанокобаламін (вітамін В12 ), тіамін (вітамін B1), піридоксин (вітамін В6)", 90, "ціанокобаламін (вітамін В12 ), тіамін (вітамін B1), піридоксин (вітамін В6)", 326M, "Балканфарма-Дупниця АТ", "Ізраїль")
                ,new Pharm("Неуробекс-Тева таблетки, в/плів. обол. №150 у бан.", "Неуробекс-Тева", "таблетки", "ціанокобаламін (вітамін В12 ), тіамін (вітамін B1), піридоксин (вітамін В6)", 150, "ціанокобаламін (вітамін В12 ), тіамін (вітамін B1), піридоксин (вітамін В6)", 470.2M, "Балканфарма-Дупниця АТ", "Ізраїль")
                ,new Pharm("Метилурацил таблетки по 0.5 г №10", "Метилурацил", "таблетки", "метилурацил", 10, "метилурацил: 500 мг", 117.9M, "ПАТ«Монфарм»", "Україна")
            };

            return entities;
        }
    }
}
